Revit 2024 API
ParameterTypeId.WindowTypeId Property
 "Type Mark"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId WindowTypeId { get; }
Visual Basic
Public Shared ReadOnly Property WindowTypeId As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ WindowTypeId {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace